src/Catalogs/Оповещения/Оповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Оповещения</name>
  <attributes>
    <name>ВключитьПоказателиВТекстОповещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИнтервалМеждуОповещениями</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалОЗакрытии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполняющееЗадание</name>
    <type>
      <types>CatalogRef.ОчередьЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОтбораДляИнцидентов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельныеШаблоныОЗакрытии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтноситсяКТипуИнцидента</name>
    <type>
      <types>CatalogRef.ТипыИнцидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОповещенияЗакрытие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОповещенияСмс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОповещенияСмсЗакрытие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемаОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемаОповещенияЗакрытие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПоказателей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодГруппировкиОповещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПовторногоОповещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РолиПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоПочте</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоСМС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУведомлятьС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеУведомлятьПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРеакции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОповещатьНеактуальный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОповещатьЗакрыт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУведомлятьУдалять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоСкайпу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Оповещения/Forms/ФормаУстановитьЗначенияВыбранным/Module.bsl
#Область ОбработчикиСобытиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЭтотОбъект.ПериодГруппировкиОповещений = ЭтотОбъект.Параметры.ПериодГруппировкиОповещений;
    ЭтотОбъект.ПериодПовторногоОповещения = ЭтотОбъект.Параметры.ПериодПовторногоОповещения;
    ЭтотОбъект.ИнтервалОЗакрытии = ЭтотОбъект.Параметры.ИнтервалОЗакрытии;
        
    Для Каждого ТекОповещение Из ЭтотОбъект.Параметры.Оповещения Цикл
        
        НовСтрока = ЭтотОбъект.Оповещения.Добавить();
        НовСтрока.Оповещение = ТекОповещение;
        
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
    
    ЗаписатьНаСервере();
    ЭтотОбъект.Закрыть("Обновить");
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНаСервере()
    
    Для Каждого ТекОповещение Из ЭтотОбъект.Оповещения Цикл
        
        СпрОбъект = ТекОповещение.Оповещение.ПолучитьОбъект();
        СпрОбъект.ПериодГруппировкиОповещений = ЭтотОбъект.ПериодГруппировкиОповещений;
        СпрОбъект.ПериодПовторногоОповещения = ЭтотОбъект.ПериодПовторногоОповещения;
        СпрОбъект.ИнтервалОЗакрытии = ЭтотОбъект.ИнтервалОЗакрытии;
        СпрОбъект.ДополнительныеСвойства.Вставить("НеПроверять", Истина);
        СпрОбъект.Записать();
        
    КонецЦикла;
        
КонецПроцедуры

#КонецОбласти
